{
  "nav.home": "Home",
  "nav.experience": "Experience",
  "nav.projects": "Projects",
  "nav.skills": "Skills",
  "nav.about": "About me",
  "nav.contact": "Contact",

  "hero.name": "Lautaro Cantero",
  "hero.role": "Full Stack Developer",
  "hero.welcome": "Welcome to my portfolio!",

  "buttons.linkedin": "Linkedin",
  "buttons.downloadCV": "Download CV",
  "buttons.seeMore": "See more",

  "section.previousJobs": "Companies I have",
  "section.job": "worked for",
  "jobs.vilotech": "Vilotech",
  "jobs.codetria": "Codetria",

  "experience.title": "Experience",
  "experience.tech": "Technologies used",
  "experience.task.realized": "Realized task",
  "experience.participation": "Participation",
  "experience.tech.long": "Technologies implemented",
  "experience.button.read.more": "Read more",
  "experience.button.read.less": "Read less",

  "task.fixStyles": "Fixing broken styles",
  "task.restructureViews": "Restructuring views",
  "task.formValidation": "Form validation",
  "task.componentOrganization": "Organization",
  "task.componentDocumentation": "Documentation",
  "task.endpointCreation": "Endpoint creation",
  "task.navigationOptimization": "Navigation optimization",
  "task.newRoutesCreation": "New routes creation",
  "task.componentImplementation": "Component implementation",
  "task.hooksImplementation": "Hooks implementation",
  "task.useOfI18n": "Use of i18n",
  "task.unitTestingImplementation": "Unit testing implementation",
  "task.tableImplementation": "Table implementation",
  "task.axiosCRUDs": "Data management",

  "TaskEnum.CorreccionEstilosRotos": "Fixing broken styles",
  "TaskEnum.ReestructuracionVistas": "Restructuring views",
  "TaskEnum.ValidacionFormularios": "Form validation",
  "TaskEnum.OrganizacionComponentes": "Organization",
  "TaskEnum.DocumentacionComponentes": "Documentation",
  "TaskEnum.CreacionEndpoints": "Endpoint creation",
  "TaskEnum.OptimizacionNavegacion": "Navigation optimization",
  "TaskEnum.CreacionNuevasRutas": "New routes creation",
  "TaskEnum.ImplementacionComponentes": "Component implementation",
  "TaskEnum.ImplementacionHooks": "Hooks implementation",
  "TaskEnum.UtilizacionI18n": "Use of i18n",
  "TaskEnum.ImplementacionPruebasUnitarias": "Unit testing implementation",
  "TaskEnum.ImplementacionTablas": "Table implementation",
  "TaskEnum.CRUDsAxios": "Data management",

  "experience.extensionApp.title": "YouTube Extension",
  "experience.extensionApp.description": "YouTube Extension that enhances the desktop experience by providing detailed control, customization options, and useful features that enrich interaction with the platform.",
  "experience.extensionApp.objective": "The YouTube Extension aims to transform the desktop experience by offering more detailed and flexible control over its interface. It allows users to hide unnecessary or distracting sections, customize navigation according to their preferences, and modify default platform behaviors to achieve a smoother and more adaptive interaction. With these features, the extension provides a clearer, more organized, and efficient experience, enabling each user to tailor the platform to their specific needs and enjoy an optimized environment for daily use.",
  "experience.extensionApp.tasksDescription": "During my participation in this project, I developed functionalities that manipulated the YouTube DOM, such as conditional hiding of elements. I also implemented and optimized hooks to accelerate the integration of new features, and documented each process to maintain a clear, scalable, and easy-to-maintain project.",
  "experience.extensionApp.technologiesDescription": "The project was developed using React, TypeScript, and Tailwind, along with the Chrome Extensions API and @crxjs/vite-plugin to build the browser extension, fully leveraging modern frontend development capabilities and integration with browser APIs.",
  "experience.extensionApp.task.hooks": "I created specialized hooks to manipulate the YouTube DOM, enabling conditional hiding of elements and customizing the interface according to user needs. These hooks also facilitated logic reuse across different components, reducing development time, improving team efficiency, and ensuring a more organized and scalable implementation.",
  "experience.extensionApp.task.documentation": "I produced clear and accessible documentation for each component, detailing properties and usage examples in both Spanish and English, which helped maintain consistency and facilitated collaboration within the project.",

  "experience.tennisApp.title": "Tennis Application",
  "experience.tennisApp.description": "Tennis app designed for all skill levels, to connect with coaches and book lessons.",
  "experience.tennisApp.objective": "Accessible, clear, and organized platform designed so beginner, intermediate, and advanced players could find suitable coaches and manage their lessons easily.",
  "experience.tennisApp.tasksDescription": "In my contribution to the development, I focused on improving both the visual experience and the technical functionality of the system.",
  "experience.tennisApp.technologiesDescription": "The project was developed using React, TypeScript, and SASS on the frontend, while MongoDB was used on the backend for persistence, queries, and business logic.",
  "experience.tennisApp.task.fixStyles": "I corrected visual inconsistencies or broken components, always ensuring a uniform and responsive interface.",
  "experience.tennisApp.task.restructureViews": "I reorganized the views of different sections, applying final design templates to ensure responsiveness, accessibility, and client requirements.",
  "experience.tennisApp.task.formValidation": "I implemented form validations to ensure data integrity, such as required fields and specific conditions.",
  "experience.tennisApp.task.documentation": "I created clear and accessible documentation for each component, detailing properties and usage examples in both Spanish and English.",
  "experience.tennisApp.task.i18n": "I used i18n in my functions and components to support multiple languages and improve the experience of international users.",
  "experience.tennisApp.task.endpoints": "I developed backend endpoints to connect functionalities with the database and integrate them into the frontend.",
  "experience.tennisApp.task.navigation": "I optimized internal navigation to reduce load times and improve usability, using techniques like lazy loading and memoization.",

  "experience.hotelPlatform.title": "Hospitality Platform",
  "experience.hotelPlatform.description": "Hospitality platform to register users, access amenities, parking, and book rooms.",
  "experience.hotelPlatform.objective": "Modern and scalable solution for hotel management, enhancing both user experience and staff efficiency.",
  "experience.hotelPlatform.tasksDescription": "During this period, I mainly worked on the frontend, using React and TypeScript to build reusable components and optimize the user experience.",
  "experience.hotelPlatform.technologiesDescription": "The project was developed using React, TypeScript, and Bootstrap on the frontend, with Redux for state management. Axios was used for HTTP requests and Jest for unit testing.",
  "experience.hotelPlatform.task.fixStyles": "I corrected visual inconsistencies or broken components, always ensuring a uniform and responsive interface.",
  "experience.hotelPlatform.task.newRoutes": "I created new routes in the frontend as the application grew, incorporating complete CRUDs and new functionalities.",
  "experience.hotelPlatform.task.components": "I implemented and created reusable components following good design and accessibility practices, mainly using MUI Material.",
  "experience.hotelPlatform.task.restructureViews": "I reorganized the views of different sections, since multiple hotel environments did not maintain the same visual consistency.",
  "experience.hotelPlatform.task.hooks": "I developed custom hooks and helpers to encapsulate logic and improve maintainability.",
  "experience.hotelPlatform.task.formValidation": "I implemented form validations to ensure data integrity, using Formik and Yup for efficient form and validation management.",
  "experience.hotelPlatform.task.i18n": "I used i18n in my functions and components to support multiple languages and improve the experience of international users.",
  "experience.hotelPlatform.task.unitTests": "I added unit tests to ensure code quality and prevent regressions, using Jest and React Testing Library.",
  "experience.hotelPlatform.task.tables": "I implemented dynamic tables to display data clearly and in an organized way, using Material UI and React Table.",
  "experience.hotelPlatform.task.crudAxios": "I developed functions to create, read, update, and delete data using Axios for backend communication, creating complete routes for entities such as users, reservations, and rooms.",
  "experience.hotelPlatform.task.navigation": "I optimized internal navigation to reduce load times and improve usability, using techniques like lazy loading and memoization.",

  "projects.title": "Projects",
  "projects.kiosco.title": "Kiosco App",
  "projects.kiosco.description": "Retail store manager. Especially useful for keeping track of products sold and the sales of each employee.",
  "projects.kiosco.why.to.use": "Use Kiosco App to",

  "skills.title": "Skills",

  "about.title": "About me",
  "about.greeting": "Hello! How are you? My name is",
  "about.name": "Lautaro Nicolas Cantero",
  "about.role": "25-year-old full stack developer, passionate about technology and design.",
  "about.experience": "I worked for more than 3 years as a Front End Developer and currently work as a full stack freelancer. My main skills include React, Node.js, and TypeScript.",
  "about.focus": "Focused on learning new technologies",
  "about.contact": "If you want to contact me",

  "contact.title": "Contact",
  "contact.name": "Name",
  "contact.email": "Email",
  "contact.message": "Message",
  "contact.send": "Send",

  "contact.success": "Thank you for contacting me, I will reply shortly",
  "contact.error": "Could not send the email, please try again!"

}
