{
  "nav.home": "Home",
  "nav.experience": "Experience",
  "nav.projects": "Projects",
  "nav.skills": "Skills",
  "nav.about": "About me",
  "nav.contact": "Contact",

  "hero.name": "Lautaro Cantero",
  "hero.role": "Full Stack Developer",
  "hero.welcome": "Welcome to my portfolio!",

  "buttons.linkedin": "Linkedin",
  "buttons.downloadCV": "Download CV",
  "buttons.seeMore": "See more",

  "section.previousJobs": "Companies I have",
  "section.job": "worked for",
  "jobs.vilotech": "Vilotech",
  "jobs.codetria": "Codetria",

  "experience.title": "Experience",
  "experience.tech": "Technologies used",
  "experience.task.realized": "Realized task",
  "experience.participation": "Participation",
  "experience.tech.long": "Technologies implemented",
  "experience.button.read.more": "Read more",
  "experience.button.read.less": "Read less",

  "task.fixStyles": "Fixing broken styles",
  "task.restructureViews": "Restructuring views",
  "task.formValidation": "Form validation",
  "task.componentOrganization": "Organization",
  "task.componentDocumentation": "Documentation",
  "task.endpointCreation": "Endpoint creation",
  "task.navigationOptimization": "Navigation optimization",
  "task.newRoutesCreation": "New routes creation",
  "task.componentImplementation": "Component implementation",
  "task.hooksImplementation": "Hooks implementation",
  "task.useOfI18n": "Use of i18n",
  "task.unitTestingImplementation": "Unit testing implementation",
  "task.tableImplementation": "Table implementation",
  "task.axiosCRUDs": "Data management",

  "TaskEnum.CorreccionEstilosRotos": "Fixing broken styles",
  "TaskEnum.ReestructuracionVistas": "Restructuring views",
  "TaskEnum.ValidacionFormularios": "Form validation",
  "TaskEnum.OrganizacionComponentes": "Organization",
  "TaskEnum.DocumentacionComponentes": "Documentation",
  "TaskEnum.CreacionEndpoints": "Endpoint creation",
  "TaskEnum.OptimizacionNavegacion": "Navigation optimization",
  "TaskEnum.CreacionNuevasRutas": "New routes creation",
  "TaskEnum.ImplementacionComponentes": "Component implementation",
  "TaskEnum.ImplementacionHooks": "Hooks implementation",
  "TaskEnum.UtilizacionI18n": "Use of i18n",
  "TaskEnum.ImplementacionPruebasUnitarias": "Unit testing implementation",
  "TaskEnum.ImplementacionTablas": "Table implementation",
  "TaskEnum.CRUDsAxios": "Data management",

  "experience.extensionApp.title": "YouTube Extension",
  "experience.extensionApp.description": "YouTube Extension that enhances the desktop experience by providing detailed control, customization options, and useful features that enrich interaction with the platform.",
  "experience.extensionApp.objective": "The YouTube Extension aims to transform the desktop experience by offering more detailed and flexible control over its interface. It allows users to hide unnecessary or distracting sections, customize navigation according to their preferences, and modify default platform behaviors to achieve a smoother and more adaptive interaction. With these features, the extension provides a clearer, more organized, and efficient experience, enabling each user to tailor the platform to their specific needs and enjoy an optimized environment for daily use.",
  "experience.extensionApp.tasksDescription": "During my participation in this project, I developed functionalities that manipulated the YouTube DOM, such as conditional hiding of elements. I also implemented and optimized hooks to accelerate the integration of new features, and documented each process to maintain a clear, scalable, and easy-to-maintain project.",
  "experience.extensionApp.technologiesDescription": "The project was developed using React, TypeScript, and Tailwind, along with the Chrome Extensions API and @crxjs/vite-plugin to build the browser extension, fully leveraging modern frontend development capabilities and integration with browser APIs.",
  "experience.extensionApp.task.hooks": "I created specialized hooks to manipulate the YouTube DOM, enabling conditional hiding of elements and customizing the interface according to user needs. These hooks also facilitated logic reuse across different components, reducing development time, improving team efficiency, and ensuring a more organized and scalable implementation.",
  "experience.extensionApp.task.documentation": "I produced clear and accessible documentation for each component, detailing properties and usage examples in both Spanish and English, which helped maintain consistency and facilitated collaboration within the project.",

  "experience.tennisApp.title": "Tennis Application",
  "experience.tennisApp.description": "Tennis app designed for all skill levels, to connect with coaches and book lessons.",
  "experience.tennisApp.objective": "Accessible, clear, and organized platform designed so beginner, intermediate, and advanced players could find suitable coaches and manage their lessons easily.",
  "experience.tennisApp.tasksDescription": "In my contribution to the development, I focused on improving both the visual experience and the technical functionality of the system.",
  "experience.tennisApp.technologiesDescription": "The project was developed using React, TypeScript, and SASS on the frontend, while MongoDB was used on the backend for persistence, queries, and business logic.",
  "experience.tennisApp.task.fixStyles": "I corrected visual inconsistencies or broken components, always ensuring a uniform and responsive interface.",
  "experience.tennisApp.task.restructureViews": "I reorganized the views of different sections, applying final design templates to ensure responsiveness, accessibility, and client requirements.",
  "experience.tennisApp.task.formValidation": "I implemented form validations to ensure data integrity, such as required fields and specific conditions.",
  "experience.tennisApp.task.documentation": "I created clear and accessible documentation for each component, detailing properties and usage examples in both Spanish and English.",
  "experience.tennisApp.task.i18n": "I used i18n in my functions and components to support multiple languages and improve the experience of international users.",
  "experience.tennisApp.task.endpoints": "I developed backend endpoints to connect functionalities with the database and integrate them into the frontend.",
  "experience.tennisApp.task.navigation": "I optimized internal navigation to reduce load times and improve usability, using techniques like lazy loading and memoization.",

  "experience.hotelPlatform.title": "Hospitality Platform",
  "experience.hotelPlatform.description": "Hospitality platform to register users, access amenities, parking, and book rooms.",
  "experience.hotelPlatform.objective": "Modern and scalable solution for hotel management, enhancing both user experience and staff efficiency.",
  "experience.hotelPlatform.tasksDescription": "During this period, I mainly worked on the frontend, using React and TypeScript to build reusable components and optimize the user experience.",
  "experience.hotelPlatform.technologiesDescription": "The project was developed using React, TypeScript, and Bootstrap on the frontend, with Redux for state management. Axios was used for HTTP requests and Jest for unit testing.",
  "experience.hotelPlatform.task.fixStyles": "I corrected visual inconsistencies or broken components, always ensuring a uniform and responsive interface.",
  "experience.hotelPlatform.task.newRoutes": "I created new routes in the frontend as the application grew, incorporating complete CRUDs and new functionalities.",
  "experience.hotelPlatform.task.components": "I implemented and created reusable components following good design and accessibility practices, mainly using MUI Material.",
  "experience.hotelPlatform.task.restructureViews": "I reorganized the views of different sections, since multiple hotel environments did not maintain the same visual consistency.",
  "experience.hotelPlatform.task.hooks": "I developed custom hooks and helpers to encapsulate logic and improve maintainability.",
  "experience.hotelPlatform.task.formValidation": "I implemented form validations to ensure data integrity, using Formik and Yup for efficient form and validation management.",
  "experience.hotelPlatform.task.i18n": "I used i18n in my functions and components to support multiple languages and improve the experience of international users.",
  "experience.hotelPlatform.task.unitTests": "I added unit tests to ensure code quality and prevent regressions, using Jest and React Testing Library.",
  "experience.hotelPlatform.task.tables": "I implemented dynamic tables to display data clearly and in an organized way, using Material UI and React Table.",
  "experience.hotelPlatform.task.crudAxios": "I developed functions to create, read, update, and delete data using Axios for backend communication, creating complete routes for entities such as users, reservations, and rooms.",
  "experience.hotelPlatform.task.navigation": "I optimized internal navigation to reduce load times and improve usability, using techniques like lazy loading and memoization.",

  "projects.title": "Projects",
"projects.kiosco.title": "Kiosco App",
"projects.kiosco.description": "Retail store manager. Especially useful to keep track of sold products and each employee’s sales",
"projects.kiosco.why.to.use": "Use Kiosco and ...",
"projects.kiosco.stack.planteamiento": "Wireframes and design concepts",
"projects.kiosco.stack.creacion": "Repository initialization and environment setup",
"projects.kiosco.stack.backend": "API construction",
"projects.kiosco.stack.frontend": "Interface creation and integration",
"projects.kiosco.stack.testing": "Ensuring quality and reliability",
"projects.kiosco.long.objective": "Facilitates product, sales, and inventory management in small businesses and convenience stores through a simple web application",
"projects.kiosco.long.objectiveDev": "KioscoApp was conceived as a web application so that anyone, even those without a desktop computer, could access it from their phone or tablet. The roadmap reflects how the idea evolved from the first sketches to the full integration of frontend and backend, always aiming to provide an accessible and scalable solution.",
"projects.kiosco.long.note": "Soon you will be able to enjoy our application on your desktop!",
"projects.kiosco.long.tasksDescription": "The system will allow registering and listing products, managing real-time sales, administering users and providers, and generating detailed reports.",
"projects.kiosco.long.technologiesDescription": "The frontend is developed with React...",
"projects.kiosco.benefit.products": "Full control of your products",
"projects.kiosco.benefit.products.desc": "Register and organize your merchandise in seconds: prices, categories, and stock always up to date.",
"projects.kiosco.benefit.sales": "Fast and secure sales",
"projects.kiosco.benefit.sales.desc": "Generate tickets and reports automatically, without manual calculations.",
"projects.kiosco.benefit.inventory": "Up-to-date inventory",
"projects.kiosco.benefit.inventory.desc": "Avoid losses and surprises: Kiosco shows you which products are running out and which sell the most.",
"projects.kiosco.benefit.access": "Access from any device",
"projects.kiosco.benefit.access.desc": "As a web application, you can use it from your computer, tablet, or phone.",
"projects.kiosco.benefit.ui": "Simple and user-friendly interface",
"projects.kiosco.benefit.ui.desc": "Designed so anyone can use it without technical knowledge.",
"projects.kiosco.reason.smallBusiness": "Made with small businesses in mind.",
"projects.kiosco.reason.saveTime": "Helps you save time and effort in daily operations.",
"projects.kiosco.reason.clearInfo": "Clear and reliable information to make better decisions.",
"projects.kiosco.reason.scalable": "Portable and scalable: start with the basics and grow with you.",
"projects.kiosco.roadmap.design.title": "Initial design in Figma",
"projects.kiosco.roadmap.design.desc": "The idea was first designed in Figma, prioritizing a clean and modern interface. The proposal took inspiration from widely known shopping apps such as Mercado Libre, Temu, and Amazon, so users would feel comfortable and familiar from the very first use.",
"projects.kiosco.roadmap.model.title": "Data modeling",
"projects.kiosco.roadmap.model.desc": "The next step was designing database relationships using ER diagrams. The main entities were defined first: seller, product, and the different presentations of each product. This foundation allowed structuring information coherently and laid the groundwork for managing sales, inventory, and users within the application.",
"projects.kiosco.roadmap.endpoints.title": "First endpoints",
"projects.kiosco.roadmap.endpoints.desc": "The backend creation was the first piece of code in the project. Routes and controllers were implemented in Node.js with Express and TypeScript, designed to be clear and self-descriptive. This foundation established an organized and reliable API on which further functionalities would be built.",
"projects.kiosco.roadmap.frontend.title": "Initial frontend",
"projects.kiosco.roadmap.frontend.desc": "The first pages were built in React, chosen for component reuse, combined with TypeScript for strict typing. The interface was developed with MUI elements, applying the previously approved color palette and typography. The initial Figma design was used as a guide to maintain visual coherence and ensure a clean, modern experience inspired by shopping apps like Mercado Libre, Temu, and Amazon.",
"projects.kiosco.roadmap.auth.title": "JWT authentication",
"projects.kiosco.roadmap.auth.desc": "Once the initial screens were defined, authentication was implemented. Pages were developed to create an account and log in, ensuring a smooth user experience. For security, bcrypt was chosen for password hashing and JWT for session management, guaranteeing reliable and protected access at all times.",
"projects.kiosco.roadmap.api.title": "API consumption",
"projects.kiosco.roadmap.api.desc": "With the initial screens ready and authentication implemented, the next step was connecting the frontend with the backend. The frontend began consuming endpoints in real time, integrating product, sales, and inventory operations. This stage validated communication between both layers and ensured the application worked coherently and dynamically.",
"projects.kiosco.roadmap.screens.title": "Remaining screens",
"projects.kiosco.roadmap.screens.desc": "After the initial integration between frontend and backend, new modules were added to expand the application's capabilities. Inventory management, report generation, and user administration were incorporated, consolidating a more complete system prepared to meet the daily needs of small businesses.",
"projects.kiosco.roadmap.docs.title": "Documentation",
"projects.kiosco.roadmap.docs.desc": "When the code reached greater complexity and volume, both frontend and backend were documented. Clear descriptions of data flow, instructions on how to add new features, and technical clarifications were created to facilitate project understanding. Documentation included diagrams and narratives that helped maintain traceability and ensured any developer could continue the work in an orderly and efficient way.",
"projects.kiosco.roadmap.testing.title": "Testing",
"projects.kiosco.roadmap.testing.desc": "Finally, tests were added to endpoints and additional validations in the backend. This stage verified correct route functionality, ensured data integrity, and reinforced application security. With middlewares and automated tests, it was guaranteed that each new feature could be integrated without compromising system stability.",
"projects.kiosco.roadmap.deploy.title": "Deploy",
"projects.kiosco.roadmap.deploy.desc": "With tests and validations completed, the next goal is to prepare the application deployment. Although the project is still in development, the architecture is already ready to be published in a production environment. Very soon it will be deployed, offering users a solution accessible from any device.",
"projects.kiosco.why.choose": "Why choose",
"projects.kiosco.long.historyDev": "History and development",
"projects.kiosco.buttons.code": "View code",
"projects.kiosco.buttons.design": "View design in Figma",
"projects.kiosco.buttons.page": "Go to page",


  "skills.title": "Skills",

  "about.title": "About me",
  "about.greeting": "Hello! How are you? My name is",
  "about.name": "Lautaro Nicolas Cantero",
  "about.role": "25-year-old full stack developer, passionate about technology and design.",
  "about.experience": "I worked for more than 3 years as a Front End Developer and currently work as a full stack freelancer. My main skills include React, Node.js, and TypeScript.",
  "about.focus": "Focused on learning new technologies",
  "about.contact": "If you want to contact me",

  "contact.title": "Contact",
  "contact.name": "Name",
  "contact.email": "Email",
  "contact.message": "Message",
  "contact.send": "Send",

  "contact.success": "Thank you for contacting me, I will reply shortly",
  "contact.error": "Could not send the email, please try again!"

}
