{
  "nav.home": "Inicio",
  "nav.experience": "Experiencia",
  "nav.projects": "Proyectos",
  "nav.skills": "Habilidades",
  "nav.about": "Sobre mí",
  "nav.contact": "Contacto",

  "hero.name": "Lautaro Cantero",
  "hero.role": "Desarrollador Full Stack",
  "hero.welcome": "¡Bienvenido a mi portafolio!",

  "buttons.linkedin": "Linkedin",
  "buttons.downloadCV": "Descargar CV",
  "buttons.seeMore": "Ver más",

  "section.previousJobs": "Empresas para las que he",
  "section.job": "trabajado",
  "jobs.vilotech": "Vilotech",
  "jobs.codetria": "Codetria",

  "experience.title": "Experiencia",
  "experience.tech": "Tecnologías utilizadas",
  "experience.task.realized": "Tareas realizadas",
  "experience.participation": "Participación",
  "experience.tech.long": "Tecnologías utilizadas",
  "experience.button.read.more": "ver más",
  "experience.button.read.less": "ver menos",

  "task.fixStyles": "Corrección de estilos",
  "task.restructureViews": "Reestructuración de vistas",
  "task.formValidation": "Validación de formularios",
  "task.componentOrganization": "Organización",
  "task.componentDocumentation": "Documentación",
  "task.endpointCreation": "Creación de endpoints",
  "task.navigationOptimization": "Optimización",
  "task.newRoutesCreation": "Creación de nuevas rutas",
  "task.componentImplementation": "Creación de componentes",
  "task.hooksImplementation": "Creación de hooks",
  "task.useOfI18n": "Utilización de i18n",
  "task.unitTestingImplementation": "Implementación de testing",
  "task.tableImplementation": "Creación de tablas",
  "task.axiosCRUDs": "Gestión de datos",

  "experience.extensionApp.title": "Extensión de YouTube",
  "experience.extensionApp.description": "Extensión de YouTube que mejora la experiencia de escritorio proporcionando control detallado, opciones de personalización y características útiles que enriquecen la interacción con la plataforma.",
  "experience.extensionApp.objective": "La extensión de YouTube busca transformar la experiencia de escritorio ofreciendo un control más detallado y flexible sobre su interfaz. Permite ocultar secciones innecesarias, personalizar la navegación y modificar comportamientos predeterminados para lograr una interacción más fluida y adaptada. Con estas funciones, la extensión brinda una experiencia más clara, organizada y eficiente, donde cada usuario puede ajustar la plataforma a sus necesidades específicas y disfrutar de un entorno optimizado para su uso diario.",
  "experience.extensionApp.tasksDescription": "Durante mi participación en este proyecto, desarrollé funcionalidades que manipulaban el DOM de YouTube, como la ocultación condicional de elementos. También implementé y optimicé hooks para acelerar la incorporación de nuevas características, y documenté cada proceso para mantener un proyecto claro, escalable y fácil de mantener.",
  "experience.extensionApp.technologiesDescription": "El proyecto fue desarrollado utilizando React, TypeScript y Tailwind, acompañado de Chrome Extensions API y @crxjs/vite-plugin para crear la extensión de navegador, aprovechando al máximo las capacidades modernas de desarrollo frontend y la integración con APIs de navegador.",
  "experience.extensionApp.task.hooks": "Creé hooks especializados para manipular el DOM de YouTube, permitiendo ocultar elementos de forma condicional y personalizar la interfaz según las necesidades del usuario. Estos hooks facilitaron la reutilización de lógica en diferentes componentes, reduciendo el tiempo de desarrollo, mejorando la eficiencia del equipo y asegurando una implementación más ordenada y escalable.",
  "experience.extensionApp.task.documentation": "Elaboré documentación clara y accesible para cada componente, detallando propiedades y ejemplos de uso en español e inglés, lo que permitió mantener la consistencia y facilitar la colaboración dentro del proyecto.",



  "experience.tennisApp.title": "Aplicación de Tenis",
  "experience.tennisApp.description": "Aplicación de tenis pensada para todos los niveles de habilidad, para contactar con entrenadores y reservar clases.",
  "experience.tennisApp.objective": "Plataforma accesible, clara y organizada, diseñada para que jugadores principiantes, intermedios y avanzados pudieran encontrar entrenadores adecuados y gestionar sus clases de manera sencilla.",
  "experience.tennisApp.tasksDescription": "En mi participación en el desarrollo, me enfoqué en mejorar tanto la experiencia visual como la funcionalidad técnica del sistema.",
  "experience.tennisApp.technologiesDescription": "El proyecto fue desarrollado utilizando React, TypeScript y SASS en el frontend, mientras que en el backend se utilizó MongoDB para la persistencia y lógica de negocio.",
  "experience.tennisApp.task.fixStyles": "Corregí inconsistencias visuales o componentes rotos, siempre garantizando una interfaz uniforme y responsiva.",
  "experience.tennisApp.task.restructureViews": "Reorganicé las vistas de diferentes secciones, aplicando las plantillas finales de diseño para asegurar que fueran responsivas, accesibles y cumplieran las demandas del cliente.",
  "experience.tennisApp.task.formValidation": "Implementé validaciones en formularios para asegurar la integridad de los datos ingresados, como campos obligatorios y condiciones específicas.",
  "experience.tennisApp.task.documentation": "Creé documentación clara y accesible para cada componente, detallando propiedades y ejemplos de uso en español e inglés.",
  "experience.tennisApp.task.i18n": "Utilicé i18n en mis funciones y componentes para soportar múltiples idiomas y mejorar la experiencia de usuarios internacionales.",
  "experience.tennisApp.task.endpoints": "Desarrollé endpoints en el backend para conectar funcionalidades con la base de datos e integrarlas en el frontend.",
  "experience.tennisApp.task.navigation": "Optimicé la navegación interna para reducir tiempos de carga y mejorar la fluidez de uso, utilizando técnicas como lazy loading y memorización.",
  
  "experience.hotelPlatform.title": "Plataforma de Hotelería",
  "experience.hotelPlatform.description": "Plataforma de hotelería para registrar usuarios, tener acceso a amenities, parking y reservar habitaciones.",
  "experience.hotelPlatform.objective": "Solución moderna y escalable para la administración de hoteles, facilitando tanto la experiencia de los usuarios como la eficiencia del personal.",
  "experience.hotelPlatform.tasksDescription": "Durante este período, trabajé principalmente en el frontend, utilizando React y TypeScript para construir componentes reutilizables y optimizar la experiencia del usuario.",
  "experience.hotelPlatform.technologiesDescription": "El proyecto fue desarrollado utilizando React, TypeScript y Bootstrap en el frontend, con Redux para la gestión del estado. Se utilizó Axios para las solicitudes HTTP y Jest para las pruebas unitarias.",
  "experience.hotelPlatform.task.fixStyles": "Corregí inconsistencias visuales o componentes rotos, siempre garantizando una interfaz uniforme y responsiva.",
  "experience.hotelPlatform.task.newRoutes": "Creé nuevas rutas en el frontend a medida que la aplicación crecía, incorporando CRUDs completos y funcionalidades nuevas.",
  "experience.hotelPlatform.task.components": "Implementé y creé componentes reutilizables siguiendo buenas prácticas de diseño y accesibilidad, mayormente utilizando MUI Material.",
  "experience.hotelPlatform.task.restructureViews": "Reorganicé las vistas de diferentes secciones, ya que múltiples entornos de hoteles no mantenían la misma consistencia visual.",
  "experience.hotelPlatform.task.hooks": "Desarrollé hooks y helpers personalizados para encapsular lógica y mejorar la mantenibilidad.",
  "experience.hotelPlatform.task.formValidation": "Implementé validaciones en formularios para asegurar la integridad de los datos ingresados, utilizando Formik y Yup para una gestión eficiente.",
  "experience.hotelPlatform.task.i18n": "Utilicé i18n en mis funciones y componentes para soportar múltiples idiomas y mejorar la experiencia de usuarios internacionales.",
  "experience.hotelPlatform.task.unitTests": "Añadí pruebas unitarias para garantizar la calidad y prevenir regresiones en el código, utilizando Jest y React Testing Library.",
  "experience.hotelPlatform.task.tables": "Implementé tablas dinámicas para mostrar datos de manera clara y ordenada, utilizando Material UI y React Table.",
  "experience.hotelPlatform.task.crudAxios": "Desarrollé funciones para crear, consultar, editar y eliminar datos utilizando Axios para la comunicación con el backend, creando rutas completas para entidades como usuarios, reservas y habitaciones.",
  "experience.hotelPlatform.task.navigation": "Optimicé la navegación interna para reducir tiempos de carga y mejorar la fluidez de uso, utilizando técnicas como lazy loading y memorización.",

  "projects.title": "Proyectos",
  "projects.in.development": "En desarrollo",
  "projects.kiosco.title": "Kiosco App",
  "projects.kiosco.description": "Gestor de tienda minorista. Especialmente útil para mantener un control de productos vendidos y la venta de cada empleado",
  "projects.kiosco.why.to.use": "Utiliza Kiosco y ...",
  "projects.kiosco.stack.planteamiento": "Wireframes y conceptos de diseño",
  "projects.kiosco.stack.creacion": "Inicialización del repositorio y configuración del entorno",
  "projects.kiosco.stack.backend": "Construcción de API",
  "projects.kiosco.stack.frontend": "Creación de la interfaz e integración",
  "projects.kiosco.stack.testing": "Asegurar calidad y confiabilidad",
  "projects.kiosco.long.objective": "Facilita la gestión de productos, ventas e inventario en pequeños negocios y tiendas de abarrotes mediante una aplicación web simple",
  "projects.kiosco.long.objectiveDev": "KioscoApp fue concebido como una aplicación web para que cualquier persona, incluso quienes no cuentan con una computadora de escritorio, pueda acceder desde su celular o tablet. El roadmap refleja cómo la idea evolucionó desde los primeros bocetos hasta la integración completa de frontend y backend, siempre con el objetivo de ofrecer una solución accesible y escalable.",
  "projects.kiosco.long.note": "¡Próximamente podrás disfrutar de nuestra aplicación en tu escritorio!",
  "projects.kiosco.long.tasksDescription": "El sistema permitirá registrar y listar productos, gestionar ventas en tiempo real, administrar usuarios y proveedores, y generar reportes detallados.",
  "projects.kiosco.long.technologiesDescription": "El frontend está desarrollado con React...",
  "projects.kiosco.benefit.products": "Control total de tus productos",
  "projects.kiosco.benefit.products.desc": "Registra y organiza tu mercadería en segundos: precios, categorías y stock siempre actualizados.",
  "projects.kiosco.benefit.sales": "Ventas rápidas y seguras",
  "projects.kiosco.benefit.sales.desc": "Genera tickets y reportes de manera automática, sin necesidad de cálculos manuales.",
  "projects.kiosco.benefit.inventory": "Inventario al día",
  "projects.kiosco.benefit.inventory.desc": "Evita pérdidas y sorpresas: Kiosco te muestra qué productos están por agotarse y cuáles se venden más.",
  "projects.kiosco.benefit.access": "Acceso desde cualquier dispositivo",
  "projects.kiosco.benefit.access.desc": "Al ser una aplicación web, puedes usarla desde tu computadora, tablet o celular.",
  "projects.kiosco.benefit.ui": "Interfaz simple y amigable",
  "projects.kiosco.benefit.ui.desc": "Diseñada para que cualquier persona pueda usarla sin necesidad de conocimientos técnicos.",
  "projects.kiosco.reason.smallBusiness": "Hecho pensando en pequeños negocios.",
  "projects.kiosco.reason.saveTime": "Te permite ahorrar tiempo y esfuerzo en tus operaciones diarias.",
  "projects.kiosco.reason.clearInfo": "Información clara y confiable para tomar mejores decisiones.",
  "projects.kiosco.reason.scalable": "Portable y escalable: empieza con lo básico y crece contigo.",
  "projects.kiosco.roadmap.design.title": "Diseño inicial en Figma",
  "projects.kiosco.roadmap.design.desc": "Se comenzó por el diseño de la idea en Figma, priorizando una interfaz limpia y moderna. La propuesta tomó inspiración de aplicaciones de compra ampliamente conocidas como Mercado Libre, Temu y Amazon, para que los usuarios se sientan cómodos y familiarizados desde el primer uso.",
  "projects.kiosco.roadmap.model.title": "Modelado de datos",
  "projects.kiosco.roadmap.model.desc": "El siguiente paso fue el diseño de las relaciones de base de datos mediante diagramas DER. Se definieron primero las entidades principales: vendedor, producto y las diferentes presentaciones de cada producto. Esta base permitió estructurar la información de manera coherente y sentar las bases para la gestión de ventas, inventario y usuarios dentro de la aplicación.",
  "projects.kiosco.roadmap.endpoints.title": "Primeros endpoints",
  "projects.kiosco.roadmap.endpoints.desc": "La creación del backend fue la primera pieza de código del proyecto. Se implementaron rutas y controladores en Node.js con Express y TypeScript, diseñados para ser claros y autodeclarativos. Esta base permitió establecer una API organizada y confiable, sobre la cual se construirían las siguientes funcionalidades.",
  "projects.kiosco.roadmap.frontend.title": "Frontend inicial",
  "projects.kiosco.roadmap.frontend.desc": "Se construyeron las primeras páginas en React, eligiendo esta librería por la reutilización de componentes y combinándola con TypeScript para un tipado estricto. La interfaz se desarrolló con elementos de MUI, aplicando la paleta de colores y tipografías previamente aprobadas. Como referencia se utilizó el diseño inicial en Figma, no de manera rígida, sino como guía para mantener coherencia visual y asegurar una experiencia limpia y moderna, inspirada en aplicaciones de compra como Mercado Libre, Temu y Amazon.",
  "projects.kiosco.roadmap.auth.title": "Autenticación JWT",
  "projects.kiosco.roadmap.auth.desc": "Una vez definidas las pantallas iniciales, se continuó con la implementación de la autenticación. Se desarrollaron las páginas para crear una cuenta e iniciar sesión, asegurando una experiencia fluida para el usuario. Para mantener la seguridad se eligió la combinación de bcrypt para el hash de contraseñas y JWT para la gestión de sesiones, garantizando un acceso confiable y protegido en todo momento.",
  "projects.kiosco.roadmap.api.title": "Consumo de APIs",
  "projects.kiosco.roadmap.api.desc": "Con las pantallas iniciales ya listas y la autenticación implementada, el siguiente avance fue conectar el frontend con el backend. El frontend comenzó a consumir los endpoints en tiempo real, integrando las operaciones de productos, ventas e inventario. Esta etapa permitió validar la comunicación entre ambas capas y asegurar que la aplicación funcionara de manera coherente y dinámica.",
  "projects.kiosco.roadmap.screens.title": "Pantallas restantes",
  "projects.kiosco.roadmap.screens.desc": "Tras la integración inicial entre frontend y backend, se añadieron nuevos módulos que ampliaron las capacidades de la aplicación. Se incorporó la gestión de inventario, la generación de reportes y la administración de usuarios, consolidando así un sistema más completo y preparado para cubrir las necesidades cotidianas de pequeños negocios.",
  "projects.kiosco.roadmap.docs.title": "Documentación",
  "projects.kiosco.roadmap.docs.desc": "Cuando el código alcanzó mayor complejidad y volumen, se procedió a documentar tanto el frontend como el backend. Se elaboraron descripciones claras del flujo de datos, instrucciones sobre cómo agregar nuevas funcionalidades y aclaraciones técnicas para facilitar la comprensión del proyecto. La documentación incluyó diagramas y narrativas que ayudaron a mantener la trazabilidad y a garantizar que cualquier desarrollador pudiera continuar con el trabajo de forma ordenada y eficiente.",
  "projects.kiosco.roadmap.testing.title": "Testing",
  "projects.kiosco.roadmap.testing.desc": "Finalmente, se añadieron pruebas a los endpoints y validaciones adicionales en el backend. Esta etapa permitió verificar el correcto funcionamiento de las rutas, asegurar la integridad de los datos y reforzar la seguridad de la aplicación. Con el uso de middlewares y tests automatizados, se garantizó que cada nueva funcionalidad pudiera integrarse sin comprometer la estabilidad del sistema.",
  "projects.kiosco.roadmap.deploy.title": "Deploy",
  "projects.kiosco.roadmap.deploy.desc": "Con las pruebas y validaciones completadas, el siguiente objetivo es preparar el despliegue de la aplicación. Aunque el proyecto aún se encuentra en desarrollo, la arquitectura ya está lista para ser publicada en un entorno productivo. Muy pronto podrá ser deployado, ofreciendo a los usuarios una solución accesible desde cualquier dispositivo.",
  "projects.kiosco.why.choose": "¿Por qué elegir",
  "projects.kiosco.long.historyDev": "Historia y desarrollo",
  "projects.buttons.code": "Ver código",
  "projects.buttons.design": "Ver diseño en Figma",
  "projects.buttons.page": "Ir a la página",



  "skills.title": "Habilidades",

  "about.title": "Sobre mí",
  "about.greeting": "¡Hola! ¿Qué tal?, mi nombre es",
  "about.name": "Lautaro Nicolas Cantero",
  "about.role": "programador full stack de 25 años, apasionado por la tecnología y el diseño.",
  "about.experience": "Trabajé más de 3 años como Front End Developer y actualmente me desempeño como freelancer full stack, mis principales habilidades incluyen React, Node.js y TypeScript.",
  "about.focus": "Enfocado en aprender nuevas tecnologías",
  "about.contact": "Si quieres contactarme",

  "contact.title": "Contacto",
  "contact.name": "Nombre",
  "contact.email": "Email",
  "contact.message": "Mensaje",
  "contact.send": "Enviar",

  "contact.success": "Gracias por contactarme, responderé a la brevedad",
  "contact.error": "No se pudo enviar el email, intenta de nuevo!"

}
