{
  "nav.home": "Inicio",
  "nav.experience": "Experiencia",
  "nav.projects": "Proyectos",
  "nav.skills": "Habilidades",
  "nav.about": "Sobre mí",
  "nav.contact": "Contacto",

  "hero.name": "Lautaro Cantero",
  "hero.role": "Desarrollador Full Stack",
  "hero.welcome": "¡Bienvenido a mi portafolio!",

  "buttons.linkedin": "Linkedin",
  "buttons.downloadCV": "Descargar CV",
  "buttons.seeMore": "Ver más",

  "section.previousJobs": "Empresas para las que he",
  "section.job": "trabajado",
  "jobs.vilotech": "Vilotech",
  "jobs.codetria": "Codetria",

  "experience.title": "Experiencia",
  "experience.tech": "Tecnologías utilizadas",
  "experience.task.realized": "Tareas realizadas",
  "experience.participation": "Participación",
  "experience.tech.long": "Tecnologías utilizadas",
  "experience.button.read.more": "ver más",
  "experience.button.read.less": "ver menos",

  "task.fixStyles": "Corrección de estilos",
  "task.restructureViews": "Reestructuración de vistas",
  "task.formValidation": "Validación de formularios",
  "task.componentOrganization": "Organización",
  "task.componentDocumentation": "Documentación",
  "task.endpointCreation": "Creación de endpoints",
  "task.navigationOptimization": "Optimización",
  "task.newRoutesCreation": "Creación de nuevas rutas",
  "task.componentImplementation": "Creación de componentes",
  "task.hooksImplementation": "Creación de hooks",
  "task.useOfI18n": "Utilización de i18n",
  "task.unitTestingImplementation": "Implementación de testing",
  "task.tableImplementation": "Creación de tablas",
  "task.axiosCRUDs": "Gestión de datos",

  "experience.extensionApp.title": "Extensión de YouTube",
  "experience.extensionApp.description": "Extensión de YouTube que mejora la experiencia de escritorio proporcionando control detallado, opciones de personalización y características útiles que enriquecen la interacción con la plataforma.",
  "experience.extensionApp.objective": "La extensión de YouTube busca transformar la experiencia de escritorio ofreciendo un control más detallado y flexible sobre su interfaz. Permite ocultar secciones innecesarias, personalizar la navegación y modificar comportamientos predeterminados para lograr una interacción más fluida y adaptada. Con estas funciones, la extensión brinda una experiencia más clara, organizada y eficiente, donde cada usuario puede ajustar la plataforma a sus necesidades específicas y disfrutar de un entorno optimizado para su uso diario.",
  "experience.extensionApp.tasksDescription": "Durante mi participación en este proyecto, desarrollé funcionalidades que manipulaban el DOM de YouTube, como la ocultación condicional de elementos. También implementé y optimicé hooks para acelerar la incorporación de nuevas características, y documenté cada proceso para mantener un proyecto claro, escalable y fácil de mantener.",
  "experience.extensionApp.technologiesDescription": "El proyecto fue desarrollado utilizando React, TypeScript y Tailwind, acompañado de Chrome Extensions API y @crxjs/vite-plugin para crear la extensión de navegador, aprovechando al máximo las capacidades modernas de desarrollo frontend y la integración con APIs de navegador.",
  "experience.extensionApp.task.hooks": "Creé hooks especializados para manipular el DOM de YouTube, permitiendo ocultar elementos de forma condicional y personalizar la interfaz según las necesidades del usuario. Estos hooks facilitaron la reutilización de lógica en diferentes componentes, reduciendo el tiempo de desarrollo, mejorando la eficiencia del equipo y asegurando una implementación más ordenada y escalable.",
  "experience.extensionApp.task.documentation": "Elaboré documentación clara y accesible para cada componente, detallando propiedades y ejemplos de uso en español e inglés, lo que permitió mantener la consistencia y facilitar la colaboración dentro del proyecto.",



  "experience.tennisApp.title": "Aplicación de Tenis",
  "experience.tennisApp.description": "Aplicación de tenis pensada para todos los niveles de habilidad, para contactar con entrenadores y reservar clases.",
  "experience.tennisApp.objective": "Plataforma accesible, clara y organizada, diseñada para que jugadores principiantes, intermedios y avanzados pudieran encontrar entrenadores adecuados y gestionar sus clases de manera sencilla.",
  "experience.tennisApp.tasksDescription": "En mi participación en el desarrollo, me enfoqué en mejorar tanto la experiencia visual como la funcionalidad técnica del sistema.",
  "experience.tennisApp.technologiesDescription": "El proyecto fue desarrollado utilizando React, TypeScript y SASS en el frontend, mientras que en el backend se utilizó MongoDB para la persistencia y lógica de negocio.",
  "experience.tennisApp.task.fixStyles": "Corregí inconsistencias visuales o componentes rotos, siempre garantizando una interfaz uniforme y responsiva.",
  "experience.tennisApp.task.restructureViews": "Reorganicé las vistas de diferentes secciones, aplicando las plantillas finales de diseño para asegurar que fueran responsivas, accesibles y cumplieran las demandas del cliente.",
  "experience.tennisApp.task.formValidation": "Implementé validaciones en formularios para asegurar la integridad de los datos ingresados, como campos obligatorios y condiciones específicas.",
  "experience.tennisApp.task.documentation": "Creé documentación clara y accesible para cada componente, detallando propiedades y ejemplos de uso en español e inglés.",
  "experience.tennisApp.task.i18n": "Utilicé i18n en mis funciones y componentes para soportar múltiples idiomas y mejorar la experiencia de usuarios internacionales.",
  "experience.tennisApp.task.endpoints": "Desarrollé endpoints en el backend para conectar funcionalidades con la base de datos e integrarlas en el frontend.",
  "experience.tennisApp.task.navigation": "Optimicé la navegación interna para reducir tiempos de carga y mejorar la fluidez de uso, utilizando técnicas como lazy loading y memorización.",
  
  "experience.hotelPlatform.title": "Plataforma de Hotelería",
  "experience.hotelPlatform.description": "Plataforma de hotelería para registrar usuarios, tener acceso a amenities, parking y reservar habitaciones.",
  "experience.hotelPlatform.objective": "Solución moderna y escalable para la administración de hoteles, facilitando tanto la experiencia de los usuarios como la eficiencia del personal.",
  "experience.hotelPlatform.tasksDescription": "Durante este período, trabajé principalmente en el frontend, utilizando React y TypeScript para construir componentes reutilizables y optimizar la experiencia del usuario.",
  "experience.hotelPlatform.technologiesDescription": "El proyecto fue desarrollado utilizando React, TypeScript y Bootstrap en el frontend, con Redux para la gestión del estado. Se utilizó Axios para las solicitudes HTTP y Jest para las pruebas unitarias.",
  "experience.hotelPlatform.task.fixStyles": "Corregí inconsistencias visuales o componentes rotos, siempre garantizando una interfaz uniforme y responsiva.",
  "experience.hotelPlatform.task.newRoutes": "Creé nuevas rutas en el frontend a medida que la aplicación crecía, incorporando CRUDs completos y funcionalidades nuevas.",
  "experience.hotelPlatform.task.components": "Implementé y creé componentes reutilizables siguiendo buenas prácticas de diseño y accesibilidad, mayormente utilizando MUI Material.",
  "experience.hotelPlatform.task.restructureViews": "Reorganicé las vistas de diferentes secciones, ya que múltiples entornos de hoteles no mantenían la misma consistencia visual.",
  "experience.hotelPlatform.task.hooks": "Desarrollé hooks y helpers personalizados para encapsular lógica y mejorar la mantenibilidad.",
  "experience.hotelPlatform.task.formValidation": "Implementé validaciones en formularios para asegurar la integridad de los datos ingresados, utilizando Formik y Yup para una gestión eficiente.",
  "experience.hotelPlatform.task.i18n": "Utilicé i18n en mis funciones y componentes para soportar múltiples idiomas y mejorar la experiencia de usuarios internacionales.",
  "experience.hotelPlatform.task.unitTests": "Añadí pruebas unitarias para garantizar la calidad y prevenir regresiones en el código, utilizando Jest y React Testing Library.",
  "experience.hotelPlatform.task.tables": "Implementé tablas dinámicas para mostrar datos de manera clara y ordenada, utilizando Material UI y React Table.",
  "experience.hotelPlatform.task.crudAxios": "Desarrollé funciones para crear, consultar, editar y eliminar datos utilizando Axios para la comunicación con el backend, creando rutas completas para entidades como usuarios, reservas y habitaciones.",
  "experience.hotelPlatform.task.navigation": "Optimicé la navegación interna para reducir tiempos de carga y mejorar la fluidez de uso, utilizando técnicas como lazy loading y memorización.",

  "projects.title": "Proyectos",
  "projects.kiosco.title": "Kiosco App",
  "projects.kiosco.description": "Gestor de tienda minorista. Especialmente util para mantener un control de productos vendidos y la venta de cada empleado",
  "projects.kiosco.why.to.use": "Utiliza Kiosco y ...",

  "skills.title": "Habilidades",

  "about.title": "Sobre mí",
  "about.greeting": "¡Hola! ¿Qué tal?, mi nombre es",
  "about.name": "Lautaro Nicolas Cantero",
  "about.role": "programador full stack de 25 años, apasionado por la tecnología y el diseño.",
  "about.experience": "Trabajé más de 3 años como Front End Developer y actualmente me desempeño como freelancer full stack, mis principales habilidades incluyen React, Node.js y TypeScript.",
  "about.focus": "Enfocado en aprender nuevas tecnologías",
  "about.contact": "Si quieres contactarme",

  "contact.title": "Contacto",
  "contact.name": "Nombre",
  "contact.email": "Email",
  "contact.message": "Mensaje",
  "contact.send": "Enviar",

  "contact.success": "Gracias por contactarme, responderé a la brevedad",
  "contact.error": "No se pudo enviar el email, intenta de nuevo!"

}
